Table of Contents
 Class IDEAProgress
Namespace
IdeaRS.OpenModel.Message
Assembly
IdeaRS.OpenModel.dll
Progress Report for IOM
public class IDEAProgress
Inheritance
object
IDEAProgress
Inherited Members
 object.Equals(object)
 object.Equals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
 object.ReferenceEquals(object, object)
 object.ToString()
Constructors
 IDEAProgress(Action<IDEAProgressReport>)
Constructor
public IDEAProgress(Action<IDEAProgressReport> callback)
Parameters
callback Action<IDEAProgressReport>
Callback function of progress
Methods
 Report(IDEAProgressReport)
Report
public void Report(IDEAProgressReport data)
Parameters
data IDEAProgressReport
Data for progress report of IOM
 Edit this page